import { Grid, Typography } from "@mui/material";
import React from "react";

const PolitikaPrivatnost = () => {
  return (
    <Grid
      container
      sx={{ display: "flex", justifyContent: "center", pt: "80px" }}
    >
      <Grid
        item
        xs={12}
        sx={{ width: "1300px", textAlign: "center", pb: "50px" }}
      >
        <Typography variant="h2" fontWeight={800}>
          ПОЛИТИКА НА ПРИВАТНОСТ
        </Typography>
      </Grid>

      <Grid container sx={{ width: "1000px" }}>
        <Grid item xs={12}>
          <Typography variant="h3" fontWeight={800}>
            1. КОИ ЛИЧНИ ИНФОРМАЦИИ СОБИРАМЕ ЗА ВАС?
            <br />
            <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            Ние собираме лични информации на различни начини. На пример, може да
            ни ги дадете вашите лични податоци кога поставувате нарачка, се
            регистрирате за сметка или членство за лојалност, купувате онлајн,
            објавувате преглед, ни испраќате пораки, се претплатите на нашите
            мејлинг листи, билтени или други форми на маркетинг комуникации ,
            поднесете апликација за работа, учествувајте во анкета, натпревар
            или наградна игра, откупете промоција или користете некоја друга
            функција на нашата услуга.
            <br /> <br /> <br />
            Можеме да ги поврземе или комбинираме вашите активности и информации
            собрани од вас на нашите веб-локации и мобилни апликации со
            информации што сме ги собрале од вас офлајн (на пр., во продавница),
            информации што ги добиваме од трети страни, како и информации што ги
            собираме автоматски преку следење технологии (дефинирани подолу).
            Ова ни овозможува да ви обезбедиме персонализирано искуство без
            оглед на тоа како комуницирате со нас.
            <br /> <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            <b>Информации за контакт и профил.</b>Можеме да собираме лични
            информации, како што се вашето име, телефонски број, адреса, деловни
            информации, пол, возраст, поштенски/поштенски број и адреса на
            е-пошта, кога ќе се регистрирате за нашата услуга, кога ќе поставите
            нарачка за испорака, ќе се регистрирате за нашата мејлинг листа,
            учествувајте во програма за понуда или лојалност, откупете или
            учествувајте во промоција, учествувајте во натпревар или наградни
            игри, купувајте или откупете подарок картичка или на друг начин
            комуницирајте или комуницирајте со нас. Ние ги користиме овие
            информации за креирање, потврдување и персонализирање на вашата
            сметка, за исполнување на вашето барање или трансакција, за директно
            да комуницираме со вас и за да ви испратиме маркетинг комуникации во
            согласност со вашите преференции..
            <br /> <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            <b>Информации за контакт и профил.</b>Можеме да собираме лични
            информации, како што се вашето име, телефонски број, адреса, деловни
            информации, пол, возраст, поштенски/поштенски број и адреса на
            е-пошта, кога ќе се регистрирате за нашата услуга, кога ќе поставите
            нарачка за испорака, ќе се регистрирате за нашата мејлинг листа,
            учествувајте во програма за понуда или лојалност, откупете или
            учествувајте во промоција, учествувајте во натпревар или наградни
            игри, купувајте или откупете подарок картичка или на друг начин
            комуницирајте или комуницирајте со нас. Ние ги користиме овие
            информации за креирање, потврдување и персонализирање на вашата
            сметка, за исполнување на вашето барање или трансакција, за директно
            да комуницираме со вас и за да ви испратиме маркетинг комуникации во
            согласност со вашите преференции.
          </Typography>
        </Grid>
      </Grid>


      <Grid container sx={{ width: "1000px", mt: '50px' }}>
        <Grid item xs={12}>
          <Typography variant="h3" fontWeight={800}>
            2. КАКО КОРИСТИМЕ ЛИЧНИ ИНФОРМАЦИИ?
            <br />
            <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            Ние собираме лични информации на различни начини. На пример, може да
            ни ги дадете вашите лични податоци кога поставувате нарачка, се
            регистрирате за сметка или членство за лојалност, купувате онлајн,
            објавувате преглед, ни испраќате пораки, се претплатите на нашите
            мејлинг листи, билтени или други форми на маркетинг комуникации ,
            поднесете апликација за работа, учествувајте во анкета, натпревар
            или наградна игра, откупете промоција или користете некоја друга
            функција на нашата услуга.
            <br /> <br /> <br />
            Можеме да ги поврземе или комбинираме вашите активности и информации
            собрани од вас на нашите веб-локации и мобилни апликации со
            информации што сме ги собрале од вас офлајн (на пр., во продавница),
            информации што ги добиваме од трети страни, како и информации што ги
            собираме автоматски преку следење технологии (дефинирани подолу).
            Ова ни овозможува да ви обезбедиме персонализирано искуство без
            оглед на тоа како комуницирате со нас.
            <br /> <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            <b>Информации за контакт и профил.</b>Можеме да собираме лични
            информации, како што се вашето име, телефонски број, адреса, деловни
            информации, пол, возраст, поштенски/поштенски број и адреса на
            е-пошта, кога ќе се регистрирате за нашата услуга, кога ќе поставите
            нарачка за испорака, ќе се регистрирате за нашата мејлинг листа,
            учествувајте во програма за понуда или лојалност, откупете или
            учествувајте во промоција, учествувајте во натпревар или наградни
            игри, купувајте или откупете подарок картичка или на друг начин
            комуницирајте или комуницирајте со нас. Ние ги користиме овие
            информации за креирање, потврдување и персонализирање на вашата
            сметка, за исполнување на вашето барање или трансакција, за директно
            да комуницираме со вас и за да ви испратиме маркетинг комуникации во
            согласност со вашите преференции..
            <br /> <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            <b>Информации за контакт и профил.</b>Можеме да собираме лични
            информации, како што се вашето име, телефонски број, адреса, деловни
            информации, пол, возраст, поштенски/поштенски број и адреса на
            е-пошта, кога ќе се регистрирате за нашата услуга, кога ќе поставите
            нарачка за испорака, ќе се регистрирате за нашата мејлинг листа,
            учествувајте во програма за понуда или лојалност, откупете или
            учествувајте во промоција, учествувајте во натпревар или наградни
            игри, купувајте или откупете подарок картичка или на друг начин
            комуницирајте или комуницирајте со нас. Ние ги користиме овие
            информации за креирање, потврдување и персонализирање на вашата
            сметка, за исполнување на вашето барање или трансакција, за директно
            да комуницираме со вас и за да ви испратиме маркетинг комуникации во
            согласност со вашите преференции.
          </Typography>
        </Grid>
      </Grid>


      <Grid container sx={{ width: "1000px", mt: '50px', mb: '80px' }}>
        <Grid item xs={12}>
          <Typography variant="h3" fontWeight={800}>
            3. КОИ ИНФОРМАЦИИ МОЖЕ ДА СЕ СОБИРААТ АВТОМАТСКИ?
            <br />
            <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            Ние собираме лични информации на различни начини. На пример, може да
            ни ги дадете вашите лични податоци кога поставувате нарачка, се
            регистрирате за сметка или членство за лојалност, купувате онлајн,
            објавувате преглед, ни испраќате пораки, се претплатите на нашите
            мејлинг листи, билтени или други форми на маркетинг комуникации ,
            поднесете апликација за работа, учествувајте во анкета, натпревар
            или наградна игра, откупете промоција или користете некоја друга
            функција на нашата услуга.
            <br /> <br /> <br />
            Можеме да ги поврземе или комбинираме вашите активности и информации
            собрани од вас на нашите веб-локации и мобилни апликации со
            информации што сме ги собрале од вас офлајн (на пр., во продавница),
            информации што ги добиваме од трети страни, како и информации што ги
            собираме автоматски преку следење технологии (дефинирани подолу).
            Ова ни овозможува да ви обезбедиме персонализирано искуство без
            оглед на тоа како комуницирате со нас.
            <br /> <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            <b>Информации за контакт и профил.</b>Можеме да собираме лични
            информации, како што се вашето име, телефонски број, адреса, деловни
            информации, пол, возраст, поштенски/поштенски број и адреса на
            е-пошта, кога ќе се регистрирате за нашата услуга, кога ќе поставите
            нарачка за испорака, ќе се регистрирате за нашата мејлинг листа,
            учествувајте во програма за понуда или лојалност, откупете или
            учествувајте во промоција, учествувајте во натпревар или наградни
            игри, купувајте или откупете подарок картичка или на друг начин
            комуницирајте или комуницирајте со нас. Ние ги користиме овие
            информации за креирање, потврдување и персонализирање на вашата
            сметка, за исполнување на вашето барање или трансакција, за директно
            да комуницираме со вас и за да ви испратиме маркетинг комуникации во
            согласност со вашите преференции..
            <br /> <br />
          </Typography>
          <Typography variant="body" sx={{ fontSize: "16px" }}>
            <b>Информации за контакт и профил.</b>Можеме да собираме лични
            информации, како што се вашето име, телефонски број, адреса, деловни
            информации, пол, возраст, поштенски/поштенски број и адреса на
            е-пошта, кога ќе се регистрирате за нашата услуга, кога ќе поставите
            нарачка за испорака, ќе се регистрирате за нашата мејлинг листа,
            учествувајте во програма за понуда или лојалност, откупете или
            учествувајте во промоција, учествувајте во натпревар или наградни
            игри, купувајте или откупете подарок картичка или на друг начин
            комуницирајте или комуницирајте со нас. Ние ги користиме овие
            информации за креирање, потврдување и персонализирање на вашата
            сметка, за исполнување на вашето барање или трансакција, за директно
            да комуницираме со вас и за да ви испратиме маркетинг комуникации во
            согласност со вашите преференции.
          </Typography>
        </Grid>
      </Grid>
    </Grid>
  );
};

export default PolitikaPrivatnost;
